Repository: rudenkoRD/Brain-Up-Quiz-app
Catalog: lib/l10n/intl_*.arb
Languages: ru_ru

# main_screen_title
source: Home
ru_ru: Главная

# my_tests_bar_title
source: My tests
ru_ru: Мои тесты

# favourite_screen_title
source: Favourite
ru_ru: Избранное

# settings_screen_title
source: Settings
ru_ru: Настройки

# create_new_test_heading
source: Create a new test
ru_ru: Создать новый тест

# heading_label
source: Title
ru_ru: Название

# subject_label
source: Subject
ru_ru: Тема

# easy_label
source: easy
ru_ru: легко

# medium_label
source: medium
ru_ru: средне

# hard_label
source: hard
ru_ru: сложно

# insane_label
source: insane
ru_ru: невозможно

# author_label
source: Author
ru_ru: Автор

# created_at_label
source: Created at
ru_ru: Создано

# difficulty_label
source: Dfficulty
ru_ru: Сложность

# mark_label
source: Mark
ru_ru: Оценка

# rating_label
source: Marks
ru_ru: Рейтинг

# single_choice_question_label
source: Single choice
ru_ru: Один правильный ответ

# yes_no_question_label
source: True / false
ru_ru: Да/нет

# short_answer_question_label
source: Short answer
ru_ru: Краткий ответ

# correct_order_question_label
source: Correct order
ru_ru: Правильный порядок

# multiple_answer_question_label
source: Multiple choice
ru_ru: Несколько ответов

# matching_question_question_label
source: Matching
ru_ru: Соответствия

# take_test_label
source: Take the test
ru_ru: Пройти тест

# delete_label
source: Delete
ru_ru: Удалить

# enter_heading_label
source: Enter a new title
ru_ru: Введите новое название

# cancel_label
source: cancel
ru_ru: отмена

# create_label
source: create
ru_ru: создать

# save_label
source: save
ru_ru: сохранить

# ok_label
source: ok
ru_ru: ок

# enter_subject_label
source: Enter a new subject
ru_ru: Введите новую тему

# next_label
source: Next
ru_ru: Далее

# select_one_correct_answer_label
source: Select one correct answer
ru_ru: Выберите один правильный ответ

# answer_error_label
source: Answer error
ru_ru: Ошибка ответа

# select_correct_answer_label
source: Select a correct answer
ru_ru: Выберите правильный ответ

# yes_label
source: True
ru_ru: Да

# no_label
source: False
ru_ru: Нет

# enter_correct_answer_label
source: Enter a correct answer
ru_ru: Введите правильный ответ

# answer_label
source: answer
ru_ru: ответ

# field_cant_be_empty_label
source: Field is required
ru_ru: Введите ответ

# place_items_in_the_correct_order_label
source: Place items in the correct order
ru_ru: Расположите ответы в правильном порядке

# select_all_correct_answers_label
source: Select all correct answers
ru_ru: Выберите все правильные ответы

# match_all_options_with_correct_answers_label
source: Match all options with correct answers
ru_ru: Сопоставьте ответы с вариантами

# finish_test_label
source: Finish the test
ru_ru: Завершить тест

# delete_test_label
source: Delete this test?
ru_ru: Удалить тест?

# delete_text_warning
source: The test will be permanently deleted!
ru_ru: Тест будет безвозвратно удален!

# add_question_label
source: Add new question
ru_ru: Добавьте задания

# select_question_type_label
source: Select type of question
ru_ru: Тип вопроса

# use_double_tap_to_delete_label
source: Double tap to delete the question
ru_ru: Чтобы удалить задание используйте двойное нажатие

# swipe_to_delete_label
source: Swipe to delete
ru_ru: Смахните чтобы удалить

# option_deleted_label
source: Option deleted
ru_ru: Вариант уделен

# incorrect_option_label
source: Incorrect option
ru_ru: Неправильный вариант

# correct_option_label
source: Correct option
ru_ru: Правильный вариант

# user_answer
source: User's answer
ru_ru: Пользовательский ответ

# ordering_tutorial
source: Add some options. Order them correctly
ru_ru: Пусто. Добавьте варианты ответов. Перетаскивая, расположите варианты в правильном порядке

# option_label
source: option:
ru_ru: вариант:

# field_should_be_unique
source: The field should be unique
ru_ru: Поле не должно совпадать с другими вариантами

# leave_blank_for_other_answer
source: Leave blank for wrong option
ru_ru: Оставьте пустым для лишнего ответа

# quiz_should_have_questions_warning_label
source: Quiz should have at least one question!
ru_ru: Тест должен иметь хотябы один вопрос

# test_not_completed_label
source: Quiz not passed
ru_ru: Тест не пройден

# test_not_completed_attention
source: To be able to vote and view questions, take the test.
ru_ru: Чтобы иметь возможность голосования и просмотра вопросов пройдите тест

# result_title
source: Result
ru_ru: Результат

# continue_label
source: Continue
ru_ru: Продолжить

# question_editing_label
source: Question editing
ru_ru: Редактирование вопроса

# question_deleted_label
source: Question deleted
ru_ru: Вопрос уделен

# question_label
source: question:
ru_ru: Вопрос:

# question_type_label
source: Question type:
ru_ru: Тип вопроса:

# option_type_label
source: Option type
ru_ru: Тип варианта ответа

# general_label
source: General
ru_ru: Общие

# notifications_label
source: Notifications
ru_ru: Уведомления

# account_label
source: Account
ru_ru: Аккаунт

# exit_label
source: Exit
ru_ru: Выйти

# time_label
source: Time
ru_ru: Время

# current_lang_label
source: current
ru_ru: текущий

# language_label
source: Language
ru_ru: Язык

# select_lang_label
source: Select language
ru_ru: Выбрерите язык

# english_lang_label
source: English
ru_ru: Английский

# russian_lang_label
source: Russian
ru_ru: Русский

# waiting_for_wifi_label
source: Waiting for internet connection
ru_ru: Ожидане интернет соединения

# login_fail_label
source: Fail. Check your password and username
ru_ru: Ошибка, проверьте пароль и имя пользователя

# signup_fail_label
source: Fail. Try again later
ru_ru: Ошибка, попробуйте позже

# waiting_for_internet_label
source: Waiting for internet connection.
ru_ru: Ожидание интеренет соединения.
